app/controllers/players_controller.rb

SELECT * FROM `players` WHERE (`players`.`id` = 5 AND (`players`.game_id = 9))
SELECT * FROM `players`
---
  def index
    @player = Player.find_by_id(session[:id])
    @players = Player.all

INSERT INTO `players` (`name`, `vote`, `game_id`) VALUES('Darren', NULL, 9)
SELECT * FROM `players` WHERE (`players`.game_id = 9)
---
  def create
    @player = Player.create(params[:player])
    session[:id] = @player.id
    @players = Player.all

DELETE FROM `players` WHERE `id` = 6
SELECT * FROM `players` WHERE (`players`.game_id = 9)
---
  def destroy
    player = Player.destroy(params[:id])
    @players = Player.all