app/controllers/votes_controller.rb

SELECT * FROM `players` WHERE (`players`.`id` = 30)
UPDATE `players` SET `vote` = 42 WHERE `id` = 30
SELECT * FROM `players`
---
  def update
    player = Player.find(session[:id])
    player.vote = params[:value]
    player.save

    @players = Player.all

UPDATE `players` SET vote = 'NULL'
SELECT * FROM `players`
---
  def reset
    Player.update_all("vote = 'NULL'")
    @players = Player.all